"""
Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік". Для виробництва цих напоїв використовуються різні інгредієнти та обмежена кількість обладнання. Задача полягає у максимізації виробництва, враховуючи обмежені ресурси.
Умови завдання:
1. "Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
2. "Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".
3. Обмеження ресурсів: 100 од. "Води", 50 од. "Цукру", 30 од. "Лимонного соку" та 40 од. "Фруктового пюре".
4. Виробництво одиниці "Лимонаду" вимагає 2 од. "Води", 1 од. "Цукру" та 1 од. "Лимонного соку".
5. Виробництво одиниці "Фруктового соку" вимагає 2 од. "Фруктового пюре" та 1 од. "Води".
Використовуючи PuLP, створіть модель, яка визначає, скільки "Лимонаду" та "Фруктового соку" потрібно виробити для максимізації загальної кількості продуктів, дотримуючись обмежень на ресурси. Напишіть програму, код якої максимізує загальну кількість вироблених продуктів "Лимонад" та "Фруктовий сік", враховуючи обмеження на кількість ресурсів.
"""

import pulp

# Створення моделі
model = pulp.LpProblem("Maximize_Volume", pulp.LpMaximize)

# Змінні
L = pulp.LpVariable("Lemonade", lowBound=0, cat="Integer")
F = pulp.LpVariable("Fruit_Juice", lowBound=0, cat="Integer")

# Цільова функція (максимізація виробництва)
model += L + F, "Total_Volume"

# Обмеження
model += 2 * L + F <= 100  # Water constraint
model += L <= 50  # Sugar constraint
model += L <= 30  # Lemon Juice constraint
model += 2 * F <= 40  # Fruit Puree constrain

# Розв'язання моделі
model.solve()

# Вивід результатів
print("Status:", pulp.LpStatus[model.status])
print("Лимонад:", L.varValue)
print("Фруктовий сік:", F.varValue)
print("Загальна продукція:", L.varValue + F.varValue)
